[
  {
    "name": "Mike Murphy",
    "pronouns": "he/him",
    "role": "Founder, Producer, Uncle Mike",
    "bio": "Mike (he/him) has been improvising since 1997 and was a long-time cast member at Jet City Improv. For the past 17 years he has been ruining your cherished holiday memories and loving every moment of it. When he isn't befouling Christmases past, he is on your timeline posting original content for Corporate Beer companies, academic institutions, and the American working class. He enjoys bathroom grafitti, his wife and children, and teriyaki chicken. Cummy Sexmas.",
    "headshot": "mike_murphy",
    "photo_1": null,
    "photo_2": null
  },
  {
    "name": "Nathan Cox",
    "pronouns": "he/him",
    "role": "Player",
    "bio": "Nathan Cox(He/Him) is a teacher, director and improviser of 20 years. He has created and performed in past shows such as A Tribe Called Yes, Britain's Baking Challenge, Claim of Thrones, Inside Voices and Shot Prov. You can occasionally catch him in Jet City's We Have Some Notes and Sound & Fury at CSz Seattle. Nathan is happy to be back with his UMRX for his 6th sick and twisted holiday season. Insta: coxshotz.",
    "headshot": "nathan_cox",
    "photo_1": "https://drive.google.com/uc?id=1OhBpNmnvsjAbmw0tITI1cC_ojemBIXOr",
    "photo_2": [
      "https://drive.google.com/uc?id=19-eYeb1IG8yuOyoHpW9lnWdWM8vTWM5L",
      "https://drive.google.com/uc?id=1Q25YbevYUvZaCfZLZOrrQuCu_DuUAJ5j",
      "https://drive.google.com/uc?id=1Bn2kNwARnckicjO1vTL7h1puLKfv-tiZ"
    ]
  },
  {
    "name": "Nick Edwards",
    "pronouns": "he/him",
    "role": "Artistic Director, Producer, Narrator, Player",
    "bio": "Nick Edwards began his Uncle Mike journey at the tender age of 0 when he was born on Christmas. A few years later in 4th grade he performed his first improv scene, miming a pet turtle pooping in his hands. Not much has changed for Nick. As an artist, he works as a director, writer, and actor of scripted and unscripted work. Most of the rest of his time is spent tapping out Python and SQL as he pursues a goal of working in sports data science and analytics. He takes great joy in directing this show and working with this team and there's absolutely no way he couldn't have done it without the love of his life, Nako. He hopes your Christmas is perfectly ruined 👼🎄✨",
    "headshot": "nick_edwards",
    "photo_1": "https://drive.google.com/uc?id=1awaHW3I_USCanVBOIg3BYJbEeJHzOVnV",
    "photo_2": [
      "https://drive.google.com/uc?id=1AAVI0sOMapmkx5nP3Hb4f7eMbFrr26dT",
      "https://drive.google.com/uc?id=1AaKxsHnZx5CpxvSWWlYldekCtb8VqIZ1"
    ]
  },
  {
    "name": "Saina Hussain",
    "role": "Player",
    "pronouns": "she/her",
    "bio": "Saina (she/her) is an ensemble member at Jet City Improv since 2023 and most recently has been in JCI Presents show The Emerald City Slasher. You can also catch her performing in the JCI flagship shows, teaching classes and improv workshops around the city, and doing camp shows with Improv4good. She is full of merry to be part of the Uncle Mike Ruins Christmas ensemble and to spread the cheers and tears of the holidays with a super talented group of improvisors!",
    "headshot": "saina_hussain",
    "photo_1": "https://drive.google.com/uc?id=1FvDEFwEz6z5hbSjFEQJLCvr44SmUE_dT",
    "photo_2": null
  },
  {
    "name": "Adria LaMorticella",
    "pronouns": "she/her",
    "role": "Player",
    "bio": "Adria has come to the show this year an Uncle Mike virgin and expects to leave a defiled, husk of her former self. Her most recent (and extremely wholesome) acting credits include “Luchadora!” and “A Tale of Peter Rabbit” at the Seattle Children’s Theatre. She writes and performs with her sketch group Better On Paper, dances with her team BFFervescent and is a retired pro wrestler.",
    "headshot": "adria_lamorticella",
    "photo_1": "https://drive.google.com/uc?id=1Bkg6W-GxaUtqf6qUG2dHq1gHi3lMAUK4",
    "photo_2": [
      "https://drive.google.com/uc?id=1u9dKnS51sZyJCB85Z8TjsWRrr20l2e68",
      "https://drive.google.com/uc?id=17R538wy262cbflH3znOwKuhSLRA_LmmQ",
      "https://drive.google.com/uc?id=1BMhX9c5Jd8NOWxeviYngJd9bUIz0Jp5D"
    ]
  },
  {
    "name": "Preston McNeil",
    "pronouns": "he/him",
    "role": "Player",
    "bio": "Preston is excited to be returning to the UMRX show. Having been apart of the show for 7 years now it’s become a great way to get into the holiday spirit. You may have seen him in past Jet city productions such as A Tribe Called Yes, Stabin Cabin and Party Favors or most recently Journey of the wind. Off the stage he’s working on music maybe you’ll hear it one day.",
    "headshot": "preston_mcneil",
    "photo_1": "https://drive.google.com/uc?id=1T6p3Uex7BmRWC6UDP9btKTWqf4fBZCrm",
    "photo_2": null
  },
  {
    "name": "Randy Miller",
    "pronouns": "he/him",
    "role": "Player",
    "bio": "Randy has been improvising in the Seattle community for 15 years and is on his 6th run of UMRX. It has become a staple of his holiday season. Randy is also an architect and woodworker. He believed in Santa until 5th grade.",
    "headshot": "randy_miller",
    "photo_1": "https://drive.google.com/uc?id=1dEsT1DBckyHIeXrTWyeUGQaalYB_fnd-",
    "photo_2": null
  },
  {
    "name": "Claudine Mboligikpelani Nako",
    "pronouns": "she/her",
    "role": "Production Manager",
    "bio": "Claudine Mboligikpelani Nako (she/her) is a multidisciplinary artist whose work includes directing, performing, and collaborating with innovators who spark her curiosity. Nako recently guest starred with musical improv company We Have Some Notes at ArtsWest with Jet City Improv. This is Nako’s second year on the Uncle Mike production team, and she loves working alongside her brilliant husband Nick, the sweet sicko who directed this show.",
    "headshot": "claudine_mboligikpelani_nako",
    "photo_1": null,
    "photo_2": null
  },
  {
    "name": "Kat Schelonka",
    "pronouns": "they/them/she/her",
    "role": "Player",
    "bio": "Kat is so excited to join the cast of Uncle Mike Ruins Christmas! Kat is a member of the Jet City Improv ensemble and the We Have Some Notes musical improv ensemble. Other recent credits include The Rest of Us (JCI), Inside Voices (director, JCI), Selling Seattle (JCI), and the Vision Euro Song Contest (CSz Seattle).",
    "headshot": "kat_schelonka",
    "photo_1": "https://drive.google.com/uc?id=11GC7bgGo8sLke4Zvucd1ndXOldRPyar-",
    "photo_2": null
  },
  {
    "name": "Ian Schempp",
    "pronouns": "he/him",
    "role": "Player",
    "bio": "Ian has been improvising since 1997 when he and some friends got together and played some \"Who's Line is it Anyway?\" games after school. They were terrible and he loved every second. Improv has been a major part of his life ever since. In college he joined and then directed Without an Box, the Claremont College's improv and experimental theater group. After moving to Seattle, he joined a collective of folks just hanging out and improvising, from which came his first improv group: Sisters of Sal. Soon after, he joined the ranks of Jet City Improv where he spent the majority of his improv career. There he created such shows as Shades of Gray, Unspeakable Horrors, and Funbucket. He joined the cast of Uncle Mike Ruins Christmas the very first year and has been in love with it ever since, missing a couple years in the middle. This show is always the highlight of his year, doing the funniest, stupidest stuff with the funniest, most wonderful people and he wouldn't trade it for anything.",
    "headshot": "ian_schempp",
    "photo_1": "https://drive.google.com/uc?id=1Uy9-Py1HWbWeo8x5TfvJ_bXDU8iFYsbw",
    "photo_2": [
      "https://drive.google.com/uc?id=1G0XT8kZ-SHBWGXfgnncN9t7aPmSz8noe",
      "https://drive.google.com/uc?id=1EtbGDRy8oCrNlLOnb1-DgLnGVzkCBL3J"
    ]
  },
  {
    "name": "Rob Scherzer",
    "pronouns": "he/him",
    "role": "Marketing Manager, Producer",
    "bio": "Rob plays the keys. More info at robscherzer.com!",
    "headshot": "rob_scherzer",
    "photo_1": "https://drive.google.com/uc?id=1lvkIrzJnDKjdI4ydluCqqXJ3mrgoM3yK",
    "photo_2": [
      "https://drive.google.com/uc?id=1U9f9PsVsskOMSbpFUvErFahwKvvE2VXg",
      "https://drive.google.com/uc?id=1WIdlXY12cTTRrwqomfyZ2vCX6QKLX_bK",
      "https://drive.google.com/uc?id=1Rz1znV5LzGM2nIpyGoDjFWn4Lxp6XnAX",
      "https://drive.google.com/uc?id=1L7PMO5ipwjKu7VpvLKM70xWmIBZpprQr"
    ]
  },
  {
    "name": "Stephani Thompson",
    "pronouns": "she/they",
    "role": "Player",
    "bio": "Stephani Thompson is a born and raised Washingtonian and has spent the last 20 years improvising and performing all over the Emerald City. She has spent time at Jet City Improv and is currently an ensemble member at Unexpected Productions. She was, for a time, Seattle's Only Burlesque Clown, Fanny Tragic. When she's not performing, she's flying a kite or looking for birds. One of Stephani's most cherished holiday memories is making cookies with her Grandma Jo. Grandma Jo had an empty spice can labeled 'Love' and she would always add that as a last ingredient.",
    "headshot": "stephani_thompson",
    "photo_1": "https://drive.google.com/uc?id=1o31iucIzUyLa-G2s2YsBp9gk4TkZnYB4",
    "photo_2": [
      "https://drive.google.com/uc?id=109PfRZIZXrXCJYO6KyBYNFeQElKcZGeU"
    ]
  },
  {
    "name": "Anthony van Winkle",
    "pronouns": "he/him",
    "role": "Technical Improviser",
    "bio": "Anthony is a technical improviser with over 20 years experience designing, directing, and improvising in some of Seattle's most ambitious and complex unscripted theater. In his spare time, he designs and builds pinball machines.",
    "headshot": "anthony_van_winkle",
    "photo_1": "https://drive.google.com/uc?id=12Snzthl6M3KvEuvcxKWIZnFlIzRfUZMM",
    "photo_2": null
  },
  {
    "name": "Doug Willott",
    "pronouns": "he/him [all welcome]",
    "role": "Founder, Producer",
    "bio": "Douglas Willott is a Seattle-born actor, director, and writer. During his tenure with Jet City Improv, he created and directed many shows including Uncle Mike Ruins Christmas, Every Movie Is a Musical, and Funbucket (with Ian Schempp). He also performed in over 25 productions at Jet City Improv, as well as in shows with Theatersports and Seattle CSz. He is currently a member of The Upfront in Bellingham, WA. Doug has worked with many very funny people including Martin Short, Elvira, Kevin McDonald of KITH and more (all lovely people), and the Uncle Mike team is easily among his favorite folx to collaborate with.",
    "headshot": "doug_willott",
    "photo_1": "https://drive.google.com/uc?id=18p_2z_7uowO1zDLgMXIwAvq3TeXR7hjg",
    "photo_2": null
  }
]
